In [1]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size= (10,3))
df = pd.DataFrame(m, columns = ['var1','var2','var3'])
df

   var1  var2  var3
0     1     3     5
1     4     2    12
2    26    11    19
3    22    11    18
4    20    29    26
5    13    20    16
6    15    26     6
7    18    12    13
8     8    16    25
9    12    24     6

In [2]:
df['var1']

0     1
1     4
2    26
3    22
4    20
5    13
6    15
7    18
8     8
9    12
Name: var1, dtype: int64

In [3]:
df[0:2]

   var1  var2  var3
0     1     3     5
1     4     2    12

In [5]:
df[0:2][['var1','var2']]

   var1  var2
0     1     3
1     4     2

In [6]:
df

   var1  var2  var3
0     1     3     5
1     4     2    12
2    26    11    19
3    22    11    18
4    20    29    26
5    13    20    16
6    15    26     6
7    18    12    13
8     8    16    25
9    12    24     6

In [7]:
df[df.var1 > 15]

   var1  var2  var3
2    26    11    19
3    22    11    18
4    20    29    26
7    18    12    13

In [10]:
df[df.var1 > 15]['var1']

2    26
3    22
4    20
7    18
Name: var1, dtype: int64

In [11]:
df[df.var1 > 15][['var1']]

   var1
2    26
3    22
4    20
7    18

In [13]:
df[(df.var1 > 15) & (df.var3 < 5)]

Empty DataFrame
Columns: [var1, var2, var3]
Index: []

In [16]:
df.loc[(df.var1 > 15), ['var1','var2']]

   var1  var2
2    26    11
3    22    11
4    20    29
7    18    12

In [18]:
df[(df.var1 > 15)][['var1','var2']]

   var1  var2
2    26    11
3    22    11
4    20    29
7    18    12